"""
1:为什么需要元组    tuple    元组
    元组可以存储多个数据（支持不同类型的）
    数据一旦被定义后，就不能被修改 （耶！没有修改函数了）
2：元组定义语法
    元组名字=(元素1,元素2,元素3....)  #括号是英文的   逗号是英文
    提示！！！
        当你元组里面，定义单个元素的时候，在单个元素后面加一个逗号
"""
# 一、元组定义提示
# tuple1 = (1)  #事与愿违！！！   缺逗号 <class 'int'>
tuple1 = (1,)  # <class 'tuple'>
print(type(tuple1))

# 二、元组存储多种数据类型
list1 = [1, 2]
tuple2 = (1, 1.5, "str", True, list1)
print(tuple2)

# 三、元组的访问
# 格式： 元组名[索引值]
print(tuple2[2])
# 需求 ：访问tuple2，找到2这个值   ctrl+a 全选   ctrl+alt+L 格式化整个代码
print(tuple2[4][1])
print(tuple2[2][1])


tuple3=(["张三","lisi","王五"],[["张三","lisi","王五"],"lisi","王五"],["张三",["张三","lisi",[["张三","lisi","a","王五"],"lisi","王五"]],["张三","lisi","王五"],["张三","lisi","王五"],"王五"],["张三","lisi","王五"])
#取a
print(tuple3[2][1][2][0][2])










